parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
#include <Arduino.h>

//! Include Header Files
#include "PIN_CONNECTION.h"
#include "CONFIGURATION.h"

//! WiFi and NTP Setup
//Reference: https://lastminuteengineers.com/esp32-ntp-server-date-time-tutorial/
#include <WiFi.h>
#include "time.h"
const char *ssid = WIFI_SSID;
const char *password = WIFI_PASSWORD;
const char *ntpServer = "asia.pool.ntp.org";
const long gmtOffset_sec = 19800; // +5:30 = (5*60*60) + (30*60) = 19800
const int daylightOffset_sec = 0; // India doesn't observe DayLight Saving
struct time_struct
{
    uint16_t year;
    uint8_t month;
    uint8_t date;
    uint8_t hour;
    uint8_t minutes;
    uint8_t seconds;
};
struct time_struct latest_time;

//! RTC DS3231 Setup
//Reference: https://how2electronics.com/esp32-ds3231-based-real-time-clock/
#include <SPI.h>
#include <Wire.h>
#include "RTClib.h" //https://adafruit.github.io/RTClib/html/index.html
RTC_DS3231 rtc;

//! OLED Setup
//Reference: https://randomnerdtutorials.com/esp32-ssd1306-oled-display-arduino-ide/
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#define SCREEN_WIDTH 128 // OLED display width, in pixels
#define SCREEN_HEIGHT 64 // OLED display height, in pixels
#define OLED_RESET -1    // Reset pin # (or -1 if sharing reset pin)
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);
#define MAIN_MENU_LIST 21
#define SUB_MENU_LEVEL 2
#define SUB_MENU_LIST 7
#define OLED_MENU_TEXT_SIZE 2
String main_menu[MAIN_MENU_LIST][SUB_MENU_LEVEL][SUB_MENU_LIST] = {
    {{"< Back"}, {}},
    {{"Item 01"}, {"< Back", "1.1", "1.2", "1.3", "1.4", "1.5", "1.6"}},
    {{"Item 02"}, {"< Back", "2.1", "2.2", "2.3", "2.4", "2.5", "2.6"}},
    {{"Item 03"}, {"< Back", "3.1", "3.2", "3.3", "3.4", "3.5", "3.6"}},
    {{"Item 04"}, {"< Back", "4.1", "4.2", "4.3", "4.4", "4.5", "4.6"}},
    {{"Item 05"}, {"< Back", "5.1", "5.2", "5.3", "5.4", "5.5", "5.6"}},
    {{"Item 06"}, {"< Back", "6.1", "6.2", "6.3", "6.4", "6.5", "6.6"}},
    {{"Item 07"}, {"< Back", "7.1", "7.2", "7.3", "7.4", "7.5", "7.6"}},
    {{"Item 08"}, {"< Back", "8.1", "8.2", "8.3", "8.4", "8.5", "8.6"}},
    {{"Item 09"}, {"< Back", "9.1", "9.2", "9.3", "9.4", "9.5", "9.6"}},
    {{"Item 10"}, {"< Back", "10.1", "10.2", "10.3", "10.4", "10.5", "10.6"}},
    {{"Item 11"}, {"< Back", "11.1", "11.2", "11.3", "11.4", "11.5", "11.6"}},
    {{"Item 12"}, {"< Back", "12.1", "12.2", "12.3", "12.4", "12.5", "12.6"}},
    {{"Item 13"}, {"< Back", "13.1", "13.2", "13.3", "13.4", "13.5", "13.6"}},
    {{"Item 14"}, {"< Back", "14.1", "14.2", "14.3", "14.4", "14.5", "14.6"}},
    {{"Item 15"}, {"< Back", "15.1", "15.2", "15.3", "15.4", "15.5", "15.6"}},
    {{"Item 16"}, {"< Back", "16.1", "16.2", "16.3", "16.4", "16.5", "16.6"}},
    {{"Item 17"}, {"< Back", "17.1", "17.2", "17.3", "17.4", "17.5", "17.6"}},
    {{"Item 18"}, {"< Back", "18.1", "18.2", "18.3", "18.4", "18.5", "18.6"}},
    {{"Item 19"}, {"< Back", "19.1", "19.2", "19.3", "19.4", "19.5", "19.6"}},
    {{"Item 20"}, {"< Back", "20.1", "20.2", "20.3", "20.4", "20.5", "20.6"}},
};

//! NRF24 Setup
//Reference: https://howtomechatronics.com/tutorials/arduino/arduino-wireless-communication-nrf24l01-tutorial/
#include <nRF24L01.h>
#include <RF24.h>
RF24 radio(NRF24_CE, NRF24_CSN);
const int AVAILABLE_CHARACTERS = 62;
char alphabet[AVAILABLE_CHARACTERS] = {
    'A', 'B', 'C', 'D', 'E', 'F', 'G',
    'H', 'I', 'J', 'K', 'L', 'M', 'N',
    'O', 'P', 'Q', 'R', 'S', 'T', 'U',
    'V', 'W', 'X', 'Y', 'Z', 'a', 'b',
    'c', 'd', 'e', 'f', 'g', 'h', 'i',
    'j', 'k', 'l', 'm', 'n', 'o', 'p',
    'q', 'r', 's', 't', 'u', 'v', 'w',
    'x', 'y', 'z', '1', '2', '3', '4',
    '5', '6', '7', '8', '9', '0'};
char BROADCAST_RECIEVER_ADDRESS[5] = {'b', 'o', 'x', 'i', 't'};
String BOX_DETAILS[MAX_BOXES][2];

//! SD Card Setup
//Reference: https://randomnerdtutorials.com/esp32-microsd-card-arduino/
#include "FS.h"
#include "SD.h"
#include <ReadLines.h> //https://github.com/mykeels/ReadLines/blob/master/examples/print-line-and-index/print-line-only.ino
const char AWS_BACKLOG_FILE[] = "AWS_Backlog_file.txt";
const char NRF_COMMUNICATION_ADDRESS_FILE[] = "NRF_Communication_file.txt";
const char BOX_ID_DETAILS_FILE[] = "Box_ID_Details.txt";
const char file_extension[] = ".txt";

//! Encoder Setup
//Reference: https://howtomechatronics.com/tutorials/arduino/rotary-encoder-works-use-arduino/
#define outputA RE_DT
#define outputB RE_CLK
#define outputS RE_SW
float counter = 0;
int aState;
int aLastState;

//! WS2812 Neopixel Ring
//Reference: https://create.arduino.cc/projecthub/robocircuits/neopixel-tutorial-1ccfb9
#include <Adafruit_NeoPixel.h>
#define NUMPIXELS 8 //Number of LEDs on NeoPixel
Adafruit_NeoPixel pixels(NUMPIXELS, RGB_D1, NEO_GRB + NEO_KHZ800);
#define RED_COLOR pixels.Color(255, 0, 0)
#define GREEN_COLOR pixels.Color(0, 255, 0)
#define BLUE_COLOR pixels.Color(0, 0, 255)
#define YELLOW_COLOR pixels.Color(255, 255, 0)

//! AWS Setup
#include <WiFiClientSecure.h>
#include <MQTT.h>
#include <ArduinoJson.h>
WiFiClientSecure net;
MQTTClient client;

//! Function Definition
void rtc_setup();
void update_oled(String text1, String text2, String text3);
void halt_rgb_ring(int led_number);
void solid_rgb_ring(uint32_t color);
void send_Success_Data(String box_id, String command, int success_status, String param1, String param2);
void sendData(String message);
void connectToMqtt(bool nonBlocking);
void messageReceived(String &topic, String &payload);

//! Function Declaration

int printLocalTime()
{
    solid_rgb_ring(RED_COLOR);
    update_oled("Updating", "NTP", "");
    struct tm timeinfo;
    if (!getLocalTime(&timeinfo))
    {
        update_oled("NTP", "Update", "Failed");
        solid_rgb_ring(GREEN_COLOR);
        return EXIT_FAILURE;
    }
    update_oled("NTP", "Update", "Success");
    latest_time.year = timeinfo.tm_year - 100;
    latest_time.month = timeinfo.tm_mon + 1;
    latest_time.date = timeinfo.tm_mday;
    update_oled((String)latest_time.year, (String)latest_time.month, (String)latest_time.date);
    Serial.println((String)latest_time.year + '/' + (String)latest_time.month + '/' + (String)latest_time.date);
    latest_time.hour = timeinfo.tm_hour;
    latest_time.minutes = timeinfo.tm_min;
    latest_time.seconds = timeinfo.tm_sec;
    update_oled((String)latest_time.hour, (String)latest_time.minutes, (String)latest_time.seconds);
    Serial.println((String)latest_time.hour + ':' + (String)latest_time.minutes + ':' + (String)latest_time.seconds);
    rtc_setup();
    return EXIT_SUCCESS;
}

