parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
void wifi_ntp_setup(void)
{
    //connect to WiFi
    solid_rgb_ring(RED_COLOR);
    Serial.printf("Connecting to %s ", ssid);
    update_oled("Wifi", "Connecting", ssid);
    WiFi.begin(ssid, password);
    while (WiFi.status() != WL_CONNECTED)
    {
        delay(50);
        Serial.print(".");
    }
    Serial.println(" CONNECTED");
    update_oled("Wifi", "Connected", ssid);
    update_oled("Connecting", "NTP", ""); //init and get the time
    configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);
    solid_rgb_ring(GREEN_COLOR);
    printLocalTime();
}

void rtc_setup()
{
    solid_rgb_ring(RED_COLOR);
    update_oled("RTC", "Connecting", "");
    if (!rtc.begin())
    {
        Serial.println("Couldn't find RTC");
        while (1)
            ;
        rtc.adjust(DateTime(latest_time.year, latest_time.month, latest_time.date, latest_time.hour, latest_time.minutes, latest_time.seconds));
    }
    update_oled("RTC", "Updated", "");
    solid_rgb_ring(GREEN_COLOR);
}

void rtc_get_time()
{
    solid_rgb_ring(RED_COLOR);
    update_oled("NTP", "Updating", "");
    DateTime now = rtc.now();
    latest_time.year = now.year();
    latest_time.month = now.month();
    latest_time.seconds = now.second();
    latest_time.hour = now.hour();
    latest_time.minutes = now.minute();
    latest_time.seconds = now.second();
    solid_rgb_ring(GREEN_COLOR);
}

void oled_setup()
{
    solid_rgb_ring(RED_COLOR);
    if (!display.begin(SSD1306_SWITCHCAPVCC, 0x3C))
    {
        Serial.println(F("SSD1306 allocation failed"));
        for (;;)
            ; // Don't proceed, loop forever
    }
    display.clearDisplay();
    display.setTextColor(WHITE);
    //display.startscrollright(0x00, 0x0F);
    display.setTextSize(OLED_MENU_TEXT_SIZE);
    display.setCursor(0, 5);
    display.print("Initializing...");
    display.display();
    delay(1000);
    solid_rgb_ring(GREEN_COLOR);
}

void update_oled(String text1, String text2, String text3)
{
    display.clearDisplay();

    display.setTextSize(OLED_MENU_TEXT_SIZE);
    display.setTextColor(WHITE);
    display.setCursor(0, 0);
    display.println(text1);
    display.setCursor(0, SCREEN_HEIGHT / 3);
    display.println(text2);
    display.setCursor(0, 2 * SCREEN_HEIGHT / 3);
    display.println(text3);
    display.display();
}

void oled_menu_update(String item1, String item2, String item3)
{
    display.clearDisplay();

    display.setTextSize(OLED_MENU_TEXT_SIZE);
    display.setTextColor(WHITE);
    display.setCursor(0, 0);
    display.println("-");
    display.setCursor(15, 0);
    display.println(item1);
    display.setCursor(15, SCREEN_HEIGHT / 3);
    display.println(item2);
    display.setCursor(15, 2 * SCREEN_HEIGHT / 3);
    display.println(item3);

    display.display();
}

void write_radio(char transmission_address[], String transmission_message)
{
    update_oled("Sending", "Message", "via NRF");
    byte address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
    {
        address[i] = transmission_address[i];
    }
    radio.openWritingPipe(address);
    radio.setPALevel(RF24_PA_MIN);
    radio.stopListening();
    radio.write(&transmission_message, sizeof(transmission_message));
    delay(100);
}

String read_radio(char recieving_address[])
{
    update_oled("Recieving", "Message", "via NRF");
    byte address[COMMUNICATION_ID_LENGTH];
    for (size_t i = 0; i < COMMUNICATION_ID_LENGTH; i++)
    {
        address[i] = recieving_address[i];
    }
    radio.openReadingPipe(0, address);
    radio.setPALevel(RF24_PA_MIN);
    radio.startListening();
    delay(100);
    String recieved_message = "";
    if (radio.available())
    {
        update_oled("Recieved", "Message", "via NRF");
        radio.read(&recieved_message, sizeof(recieved_message));
    }
    return recieved_message;
}

void createDir(fs::FS &fs, const char *path)
{
    solid_rgb_ring(RED_COLOR);
    update_oled("Creating", "Dir. in", "MicroSD");
    Serial.printf("Creating Dir: %s\n", path);
    if (fs.mkdir(path))
    {
        Serial.println("Dir created");
    }
    else
    {
        Serial.println("mkdir failed");
    }
    solid_rgb_ring(GREEN_COLOR);
}

int readFile(fs::FS &fs, const char *path)
{
    solid_rgb_ring(RED_COLOR);
    update_oled("Reading", "File from", "MicroSD");
    Serial.printf("Reading file: %s\n", path);

    File file = fs.open(path);
    if (!file)
    {
        Serial.println("Failed to open file for reading");
        return EXIT_FAILURE;
    }

    Serial.print("Read from file: ");
    while (file.available())
    {
        Serial.write(file.read());
    }
    file.close();
    solid_rgb_ring(GREEN_COLOR);
    return EXIT_SUCCESS;
}

void writeFile(fs::FS &fs, const char *path, const char *message)
{
    solid_rgb_ring(RED_COLOR);
    update_oled("Writinging", "File to", "MicroSD");
    Serial.printf("Writing file: %s\n", path);

    File file = fs.open(path, FILE_WRITE);
    if (!file)
    {
        Serial.println("Failed to open file for writing");
        return;
    }
    if (file.print(message))
    {
        Serial.println("File written");
    }
    else
    {
        Serial.println("Write failed");
    }
    file.close();
    solid_rgb_ring(GREEN_COLOR);
}

void appendFile(fs::FS &fs, const char *path, const char *message)
{
    solid_rgb_ring(RED_COLOR);
    update_oled("Appending", "File to", "MicroSD");
    Serial.printf("Appending to file: %s\n", path);

    File file = fs.open(path, FILE_APPEND);
    if (!file)
    {
        Serial.println("Failed to open file for appending");
        writeFile(SD, path, message);
        return;
    }
    if (file.print(message))
    {
        Serial.println("Message appended");
    }
    else
    {
        Serial.println("Append failed");
    }
    file.close();
    solid_rgb_ring(GREEN_COLOR);
}

void listDir(fs::FS &fs, const char *dirname, uint8_t levels)
{
    Serial.printf("Listing directory: %s\n", dirname);

    File root = fs.open(dirname);
    if (!root)
    {
        Serial.println("Failed to open directory");
        return;
    }
    if (!root.isDirectory())
    {
        Serial.println("Not a directory");
        return;
    }

    File file = root.openNextFile();
    while (file)
    {
        if (file.isDirectory())
        {
            Serial.print("  DIR : ");
            Serial.println(file.name());
            if (levels)
            {
                listDir(fs, file.name(), levels - 1);
            }
        }
        else
        {
            Serial.print("  FILE: ");
            Serial.print(file.name());
            Serial.print("  SIZE: ");
            Serial.println(file.size());
        }
        file = root.openNextFile();
    }
}

