parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
void removeDir(fs::FS &fs, const char *path)
{
    Serial.printf("Removing Dir: %s\n", path);
    if (fs.rmdir(path))
    {
        Serial.println("Dir removed");
    }
    else
    {
        Serial.println("rmdir failed");
    }
}

void sd_setup()
{
    solid_rgb_ring(RED_COLOR);
    update_oled("Setting", "up", "MicroSD");
    if (!SD.begin(SD_CS))
    {
        Serial.println("Card Mount Failed");
        update_oled("MicroSD", "Mount", "Failed");
        return;
    }

    uint64_t cardSize = SD.cardSize() / (1024 * 1024);
    Serial.printf("SD Card Size: %lluMB\n", cardSize);
    createDir(SD, "/mydir");
    writeFile(SD, "/hello.txt", "Hello ");
    appendFile(SD, "/hello.txt", "World!\n");
    readFile(SD, "/hello.txt");
    readFile(SD, "/foo.txt");
    Serial.printf("Total space: %lluMB\n", SD.totalBytes() / (1024 * 1024));
    Serial.printf("Used space: %lluMB\n", SD.usedBytes() / (1024 * 1024));
    solid_rgb_ring(GREEN_COLOR);
}

void read_rotary_encoder()
{
    solid_rgb_ring(BLUE_COLOR);
    //TODO Pause all timers
    update_oled("Starting", "to read", "Rotary Enc.");
    String item1, item2, item3;
    int main_list_pos = 0;
    int sub_list_pos = 0;
    int menu_level = 1;
    int menu_item = 0;
    int menu_length = MAIN_MENU_LIST;
    oled_menu_update(main_menu[0][0][0], main_menu[1][0][0], main_menu[2][0][0]);
    aLastState = digitalRead(outputA);
    while (1)
    {
        item1 = "";
        item2 = "";
        item3 = "";
        aState = digitalRead(outputA); // Reads the "current" state of the outputA
        if (aState != aLastState)      // If the previous and the current state of the outputA are different, that means a Pulse has occured
        {
            if (digitalRead(outputB) != aState) // If the outputB state is different to the outputA state, that means the encoder is rotating clockwise
            {
                counter += 0.5;
            }
            else
            {
                counter -= 0.5;
            }

            if ((int)counter >= menu_length - 1)
            {
                counter = menu_length - 1;
            }
            else if ((int)counter < 0)
            {
                counter = 0;
            }

            if (menu_level == 1)
            {
                menu_length = MAIN_MENU_LIST;
                main_list_pos = (int)counter;
                item1 = main_menu[main_list_pos][0][0];

                if (main_list_pos < (menu_length - 1))
                {
                    item2 = main_menu[main_list_pos + 1][0][0];
                }

                if (main_list_pos < menu_length - 2)
                {
                    item3 = main_menu[main_list_pos + 2][0][0];
                }
                menu_item = 10 * (int)counter;
            }

            else if (menu_level == 2)
            {
                sub_list_pos = (int)counter;
                item1 = main_menu[main_list_pos][1][sub_list_pos];

                if (sub_list_pos < (menu_length - 1))
                {
                    item2 = main_menu[main_list_pos][1][sub_list_pos + 1];
                }

                if (sub_list_pos < (menu_length - 2))
                {
                    item3 = main_menu[main_list_pos][1][sub_list_pos + 2];
                }
                menu_item += (int)counter;
            }
            oled_menu_update(item1, item2, item3);
            aLastState = aState; // Updates the previous state of the outputA with the current state
        }
        if (digitalRead(outputS) == HIGH)
        {
            if ((int)counter == 0)
            {
                main_list_pos = 0;
                oled_menu_update(main_menu[0][0][0], main_menu[1][0][0], main_menu[2][0][0]);
                counter = 0;
                if (menu_level == 1)
                {
                    break;
                }
                else if (menu_level == 2)
                {
                    menu_level = 1;
                }
            }
            else
            {
                menu_length = SUB_MENU_LIST;
                oled_menu_update(main_menu[(int)counter][1][0], main_menu[(int)counter][1][1], main_menu[(int)counter][1][2]);
                counter = 0;
                menu_level++;
                Serial.println(menu_level);
            }
            delay(500);
        }
    }
    solid_rgb_ring(GREEN_COLOR);
}

void solid_rgb_ring(uint32_t color)
{
    pixels.clear();
    for (size_t i = 0; i < NUMPIXELS; i++)
    {
        pixels.setPixelColor(i, color);
    }
    pixels.show();
    delay(1000);
}

void halt_rgb_ring(int led_number)
{
    pixels.clear();
    led_number = led_number % NUMPIXELS;
    pixels.setPixelColor(led_number, YELLOW_COLOR);
    pixels.show();
}

void pin_setup()
{
    pinMode(outputA, INPUT);
    pinMode(outputB, INPUT);
    pinMode(outputS, INPUT);
}

void rgb_ring_setup()
{

    pixels.begin();
    pixels.setBrightness(25);
}

void handleEachLine(char line[], int lineIndex)
{
    char box_id[BOX_ID_LENGTH];
    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < (BOX_ID_LENGTH + COMMUNICATION_ID_LENGTH); i++)
    {
        if (i < BOX_ID_LENGTH)
        {
            box_id[i] = line[i];
        }
        else
        {
            address[i - BOX_ID_LENGTH] = line[i];
        }
    }
    BOX_DETAILS[lineIndex][0] = (String)box_id;
    BOX_DETAILS[lineIndex][1] = (String)address;
}

// void read_box_details_from_sd_card()
// {
//     char line1[RL_MAX_CHARS];
//     RL.readLines(BOX_ID_DETAILS_FILE, &handleEachLine);
// }

void add_new_box(String box_id_details)
{

    srand(time(0));

    char box_id[BOX_ID_LENGTH];
    for (int i = 0; i < BOX_ID_LENGTH; i++)
    {
        box_id[i] = box_id_details[i];
    }

    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
    {
        address[i] = alphabet[rand() % (AVAILABLE_CHARACTERS - 1)];
    }

    String message = "pair," + (String)box_id + "," + (String)address;
    write_radio(BROADCAST_RECIEVER_ADDRESS, message);

    String recieved_message = read_radio(address);
    int connection_status = 0; // 0 -> Failure, 1 -> Success

    if (recieved_message = ("pair,ok," + (String)box_id))
    {
        connection_status = 1;
        char sd_message[BOX_ID_LENGTH + COMMUNICATION_ID_LENGTH];
        for (int i = 0; i < (BOX_ID_LENGTH + COMMUNICATION_ID_LENGTH); i++)
        {
            if (i < BOX_ID_LENGTH)
            {
                sd_message[i] = box_id[i];
            }
            else
            {
                sd_message[i] = address[i - BOX_ID_LENGTH];
            }
        }
        appendFile(SD, BOX_ID_DETAILS_FILE, sd_message);
    }
    send_Success_Data((String)box_id, "add", connection_status, (String)address, "");
}

void calibrate_box(String box_id_details)
{
    char box_id[BOX_ID_LENGTH];
    for (int i = 0; i < BOX_ID_LENGTH; i++)
    {
        box_id[i] = box_id_details[i];
    }

    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
    {
        // TODO: Get communication address from saved data table
    }

    String message = "cali";
    write_radio(address, message);

    String recieved_message = read_radio(address);
    int connection_status = 0; // 0 -> Failure, 1 -> Success

    if (recieved_message = ("cali,ok"))
    {
        connection_status = 1;
    }

    send_Success_Data((String)box_id, "calibrate", connection_status, "", "");
    delay(30 * 1000);

