parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
    write_radio(address, "calibration_data_update");
    String update_message = read_radio(address);
    send_Success_Data((String)box_id, "calibration_update", connection_status, update_message, "");
}

void update_box_data(String box_id, String nrf_communication_address = "")
{
    if (nrf_communication_address == NULL)
    {
        //TODO: Search in table
    }
    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
    {
        address[i] = nrf_communication_address[i];
    }

    String message = "updt";
    write_radio(address, message);

    String recieved_message = box_id + read_radio(address);
    sendData(recieved_message);
}

void change_box_setting(String box_id_details, String dt, String st, String bt)
{
    //TODO: Search in table for communicaiton id

    char address[COMMUNICATION_ID_LENGTH];

    String message = "chng," + dt + st + bt;
    write_radio(address, message);
    int success_code = 0;
    String recieved_message = read_radio(address);
    if (recieved_message == "chng,ok")
    {
        success_code = 1;
    }
    send_Success_Data(box_id_details, "change", success_code, st, bt);
}

void sound_buzzer()
{
    //TODO: Search in table for communicaiton id
    char address[COMMUNICATION_ID_LENGTH];
    String message = "buzz";
    write_radio(address, message);
}

void aws_setup()
{
    update_oled("AWS", "Setup", "In Progress");
    net.setCACert(cacert);
    net.setCertificate(client_cert);
    net.setPrivateKey(privkey);
    client.begin(MQTT_HOST, MQTT_PORT, net);
    client.onMessage(messageReceived);
    connectToMqtt(false);
    update_oled("AWS", "Setup", "Complete");
}

void messageReceived(String &topic, String &payload)
{
    //Reference: https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonParserExample/JsonParserExample.ino
    solid_rgb_ring(YELLOW_COLOR);
    Serial.println("Recieved [" + topic + "]: " + payload);
    StaticJsonDocument<50> doc;
    DeserializationError error = deserializeJson(doc, payload);
    if (error)
    {
        Serial.print(F("deserializeJson() failed: "));
        Serial.println(error.f_str());
        return;
    }
    String box_id = doc["boxid"];
    String cmd = doc["cmd"];

    // Perform action as per the command from AWS
    if (cmd == "add") // Add new Box
    {
        add_new_box(box_id);
    }
    else if (cmd == "calibrate") //Calibrate box parameters
    {
        calibrate_box(box_id);
    }
    else if (cmd == "ask") //Ask box for updated values
    {
        update_box_data(box_id);
    }
    else if (cmd == "change_setting") // Change box settings
    {
        String dt = doc["dt"];
        String st = doc["st"];
        String bt = doc["bt"];
        change_box_setting(box_id, dt, st, bt);
    }
    else if (cmd == "buzz")
    {
        sound_buzzer();
    }

    solid_rgb_ring(GREEN_COLOR);
}

void lwMQTTErr(lwmqtt_err_t reason)
{
    if (reason == lwmqtt_err_t::LWMQTT_SUCCESS)
        Serial.print("Success");
    else if (reason == lwmqtt_err_t::LWMQTT_BUFFER_TOO_SHORT)
        Serial.print("Buffer too short");
    else if (reason == lwmqtt_err_t::LWMQTT_VARNUM_OVERFLOW)
        Serial.print("Varnum overflow");
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_CONNECT)
        Serial.print("Network failed connect");
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_TIMEOUT)
        Serial.print("Network timeout");
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_READ)
        Serial.print("Network failed read");
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_WRITE)
        Serial.print("Network failed write");
    else if (reason == lwmqtt_err_t::LWMQTT_REMAINING_LENGTH_OVERFLOW)
        Serial.print("Remaining length overflow");
    else if (reason == lwmqtt_err_t::LWMQTT_REMAINING_LENGTH_MISMATCH)
        Serial.print("Remaining length mismatch");
    else if (reason == lwmqtt_err_t::LWMQTT_MISSING_OR_WRONG_PACKET)
        Serial.print("Missing or wrong packet");
    else if (reason == lwmqtt_err_t::LWMQTT_CONNECTION_DENIED)
        Serial.print("Connection denied");
    else if (reason == lwmqtt_err_t::LWMQTT_FAILED_SUBSCRIPTION)
        Serial.print("Failed subscription");
    else if (reason == lwmqtt_err_t::LWMQTT_SUBACK_ARRAY_OVERFLOW)
        Serial.print("Suback array overflow");
    else if (reason == lwmqtt_err_t::LWMQTT_PONG_TIMEOUT)
        Serial.print("Pong timeout");
}

void lwMQTTErrConnection(lwmqtt_return_code_t reason)
{
    if (reason == lwmqtt_return_code_t::LWMQTT_CONNECTION_ACCEPTED)
        Serial.print("Connection Accepted");
    else if (reason == lwmqtt_return_code_t::LWMQTT_UNACCEPTABLE_PROTOCOL)
        Serial.print("Unacceptable Protocol");
    else if (reason == lwmqtt_return_code_t::LWMQTT_IDENTIFIER_REJECTED)
        Serial.print("Identifier Rejected");
    else if (reason == lwmqtt_return_code_t::LWMQTT_SERVER_UNAVAILABLE)
        Serial.print("Server Unavailable");
    else if (reason == lwmqtt_return_code_t::LWMQTT_BAD_USERNAME_OR_PASSWORD)
        Serial.print("Bad UserName/Password");
    else if (reason == lwmqtt_return_code_t::LWMQTT_NOT_AUTHORIZED)
        Serial.print("Not Authorized");
    else if (reason == lwmqtt_return_code_t::LWMQTT_UNKNOWN_RETURN_CODE)
        Serial.print("Unknown Return Code");
}

void connectToMqtt(bool nonBlocking)
{
    Serial.print("MQTT connecting ");
    while (!client.connected())
    {
        if (client.connect(THINGNAME))
        {
            Serial.println("connected!");
            if (!client.subscribe(MQTT_SUB_TOPIC))
                lwMQTTErr(client.lastError());
        }
        else
        {
            Serial.print("SSL Error Code: ");
            //  Serial.println(net.getLastSSLError());
            Serial.print("failed, reason -> ");
            lwMQTTErrConnection(client.returnCode());
            if (!nonBlocking)
            {
                Serial.println(" < try again in 5 seconds");
                delay(5000);
            }
            else
            {
                Serial.println(" <");
            }
        }
        if (nonBlocking)
            break;
    }
}

void connectToWiFi(String init_str)
{
    if (init_str != emptyString)
        Serial.print(init_str);
    while (WiFi.status() != WL_CONNECTED)
    {
        Serial.print(".");
        delay(1000);
    }
    if (init_str != emptyString)
        Serial.println("ok!");
}

void checkWiFiThenMQTT(void)
{
    connectToWiFi("Checking WiFi");
    connectToMqtt(false);
}

