parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
unsigned long previousMillis = 0;
const long interval = 5000;

void checkWiFiThenMQTTNonBlocking(void)
{
    connectToWiFi(emptyString);
    if (millis() - previousMillis >= interval && !client.connected())
    {
        previousMillis = millis();
        connectToMqtt(true);
    }
}

void checkWiFiThenReboot(void)
{
    connectToWiFi("Checking WiFi");
    Serial.print("Rebooting");
    ESP.restart();
}

void send_Success_Data(String box_id, String command, int success_status, String param1, String param2)
{
    // Reference:https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonGeneratorExample/JsonGeneratorExample.ino
    StaticJsonDocument<50> doc;
    doc["Box ID"] = box_id;
    doc["cmd"] = command;
    doc["success"] = success_status;
    doc["param1"] = param1;
    doc["param2"] = param2;
    serializeJson(doc, Serial);
    serializeJsonPretty(doc, Serial);
    // The above line prints:
    // {
    //   "Box ID": "123456789",
    //   "cmd": add,
    //   "success": 1,
    //   "param1": "param1_data",
    //   "param2": "param2_data",
    // }
    char shadow[measureJson(doc) + 1];
    serializeJson(doc, shadow, sizeof(shadow));
    if (!client.publish(MQTT_PUB_TOPIC, shadow, false, 0))
    {
        lwMQTTErr(client.lastError());
        update_oled("AWS", command, "Failure");
    }
    else
    {
        update_oled("AWS", command, "Success");
    }
}

void sendData(String message)
{
    // Reference:https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonGeneratorExample/JsonGeneratorExample.ino
    char token = ',';
    char params[UPDATE_PARAMETERS][10] = {{}, {}, {}, {}, {}};
    char box_id[BOX_ID_LENGTH];
    int j = 0;
    for (int i = 0; i < (sizeof(message) / message[0]); i++)
    {
        if (i < BOX_ID_LENGTH)
        {
            box_id[i] = message[i];
        }

        else
        {
            if (message[i] != token)
            {
                params[j][i % 10] = message[i];
            }
            else
            {
                j++;
            }
        }
    }
    String c = (String)params[0]; //Count
    String t = (String)params[1]; //Temperature
    String b = (String)params[2]; //Battery
    String o = (String)params[3]; //Offset
    String a = (String)params[4]; //Average Weight

    StaticJsonDocument<50> doc;
    doc["time"] = latest_time.hour + '/' + latest_time.minutes + '/' + latest_time.seconds;
    doc["cmd"] = "ask";
    doc["c"] = c;
    doc["t"] = t;
    doc["b"] = b;
    doc["o"] = o;
    doc["a"] = a;
    serializeJson(doc, Serial);
    serializeJsonPretty(doc, Serial);
    // The above line prints:
    // {
    //   "Box ID": "123456789",
    //   "cmd": add,
    //   "success": 1,
    //   "param1": "param1_data",
    //   "param2": "param2_data",
    // }
    char shadow[measureJson(doc) + 1];
    serializeJson(doc, shadow, sizeof(shadow));
    if (!client.publish(MQTT_PUB_TOPIC, shadow, false, 0))
    {
        lwMQTTErr(client.lastError());
        update_oled("AWS", "update", "Failure");
    }
    else
    {
        update_oled("AWS", "update", "Success");
    }
}

void setup()
{
    Serial.begin(115200);
    pin_setup();
    rgb_ring_setup();
    aws_setup();
    oled_setup();
    wifi_ntp_setup();
    rtc_setup();
    radio.begin();
    sd_setup();
}

void loop()
{
    printLocalTime();

    //    read_rotary_encoder();
    /*
    if (radio_msg != "no")
    {
        now = time(nullptr);
        if (!client.connected())
        {
            checkWiFiThenMQTT();
            //checkWiFiThenMQTTNonBlocking();
            //checkWiFiThenReboot();
        }
        else
        {
            OLED_print("AWS", "Write");
            client.loop();
            sendData(radio_msg);
            delay(1000);
            lastMillis = millis();
            String data = get_time_format() + " : " + radio_msg + "\n";
            Serial.println("SD Message: " + data);
            appendFile(SD, "/data_file_1.txt", data);
        }
    }
    char timer[6];
    int timer_delay = 1;
    for (size_t i = 0; i < timer_delay; i++)
    {
        itoa(i, timer, 10);
        OLED_print("delay", timer);
        delay(1000);
    }

    */
}
